; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v5 - type_1 ?v2 - type_3)
 	      (pred_2 ?v3 - object ?v2 - type_3)
	      (pred_3 ?v5 - type_1 ?v7 - type_2)
	      (pred_1 ?v5 - type_1 ?v3 - object ?v7 - type_2))

   (:action op_3
       :parameters  (?v5 - type_1 ?v8 ?v4 - type_3)
       :precondition (and  (pred_4 ?v5 ?v8))
       :effect (and  (pred_4 ?v5 ?v4)
		     (not (pred_4 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_1 ?v1 - object ?v6 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v6) (pred_4 ?v5 ?v6) (pred_3 ?v5 ?v7))
       :effect (and (pred_1 ?v5 ?v1 ?v7)
		    (not (pred_2 ?v1 ?v6)) 
		    (not (pred_3 ?v5 ?v7))))

   (:action op_2
       :parameters (?v5 - type_1 ?v1 - object ?v6 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v5 ?v1 ?v7) (pred_4 ?v5 ?v6))
       :effect (and (pred_2 ?v1 ?v6)
		    (pred_3 ?v5 ?v7)
		    (not (pred_1 ?v5 ?v1 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_11 obj_01 - type_1
obj_08 obj_09 obj_10 obj_06 - type_2
obj_05 obj_02 obj_03 - type_3
obj_07 obj_12 obj_04 - object)
(:init
(pred_4 obj_11 obj_05)
(pred_3 obj_11 obj_08)
(pred_3 obj_11 obj_09)
(pred_4 obj_01 obj_05)
(pred_3 obj_01 obj_10)
(pred_3 obj_01 obj_06)
(pred_2 obj_07 obj_03)
(pred_2 obj_12 obj_03)
(pred_2 obj_04 obj_02)
)
(:goal
(and
(pred_2 obj_07 obj_03)
(pred_2 obj_12 obj_02)
(pred_2 obj_04 obj_05)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_03)))
)
)

; plan
1. (op_3 obj_11 obj_05 obj_02)
   deleted: (pred_4 obj_11 obj_05)
   added: (pred_4 obj_11 obj_02)
   goals met: 1 of 3
2. (op_3 obj_01 obj_05 obj_03)
   deleted: (pred_4 obj_01 obj_05)
   added: (pred_4 obj_01 obj_03)
   goals met: 1 of 3
3. (op_1 obj_01 obj_12 obj_03 obj_06)
   deleted: (pred_2 obj_12 obj_03) (pred_3 obj_01 obj_06)
   added: (pred_1 obj_01 obj_12 obj_06)
   goals met: 1 of 3
4. (op_1 obj_11 obj_04 obj_02 obj_09)
   deleted: (pred_2 obj_04 obj_02) (pred_3 obj_11 obj_09)
   added: (pred_1 obj_11 obj_04 obj_09)
   goals met: 1 of 3
5. (op_3 obj_01 obj_03 obj_02)
   deleted: (pred_4 obj_01 obj_03)
   added: (pred_4 obj_01 obj_02)
   goals met: 1 of 3
6. (op_3 obj_11 obj_02 obj_05)
   deleted: (pred_4 obj_11 obj_02)
   added: (pred_4 obj_11 obj_05)
   goals met: 1 of 3
7. (op_2 obj_01 obj_12 obj_02 obj_06)
   deleted: (pred_1 obj_01 obj_12 obj_06)
   added: (pred_2 obj_12 obj_02) (pred_3 obj_01 obj_06)
   goals met: 2 of 3
8. (op_2 obj_11 obj_04 obj_05 obj_09)
   deleted: (pred_1 obj_11 obj_04 obj_09)
   added: (pred_2 obj_04 obj_05) (pred_3 obj_11 obj_09)
   goals met: 3 of 3
